simple_cms/app/controllers/subjects_controller.rb

SELECT `books`.* FROM `books` WHERE `books`.`id` = 9 LIMIT 1
---
  def show
    @book = Book.find(params[:id])

INSERT INTO `books` (`title`, `author`, `genre`, `price`, `published_date`, `created_at`, `updated_at`) VALUES ('Crime and Punishment', 'Dostoevsky', 'Action', 14.32, '{1=>2020, 2=>9, 3=>16}', '2020-09-16 01:34:37.508992', '2020-09-16 01:34:37.508992')
---
  def create
    # Instantiate a new object using form parameters
    @book = Book.new(book_params)

    # Save the object
    if @book.save

SELECT `books`.* FROM `books` WHERE `books`.`id` = 15 LIMIT 1
---
  def edit
    @book = Book.find(params[:id])

SELECT `books`.* FROM `books` WHERE `books`.`id` = 15 LIMIT 1
UPDATE `books` SET `books`.`published_date` = '{1=>2022, 2=>9, 3=>16}', `books`.`updated_at` = '2020-09-16 02:12:34.900781' WHERE `books`.`id` = 15
---
  def update
    @book = Book.find(params[:id])

    if @book.update_attributes(book_params)

SELECT `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
---
  def delete
    @book = Book.find(params[:id])

SELECT `books`.* FROM `books` WHERE `books`.`id` = 9 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 9
---
  def destroy
    @book = Book.find(params[:id])
    @book.destroy